Repository: hedssaz/deep-fried-audio-player
Catalog: Deep-Fried Audio Player/Localizable.xcstrings
Source language: en
Languages: zh_hans

# audio.import
source: Import
zh_hans: 导入

source: Audio imported.
zh_hans: 音频已导入。

# audio.importFailed
source: Could not import this audio file.
zh_hans: 无法导入这个音频文件。

# audio.importing
source: Importing audio...
zh_hans: 正在导入音频...

# audio.microphoneUsageDescription
source: Deep-Fried Audio Player needs microphone access to record audio for processing.
zh_hans: 全损音质播放器需要麦克风权限来录制要处理的音频。

# audio.processingRecording
source: Processing recording...
zh_hans: 正在处理录音...

# audio.record
source: Record
zh_hans: 录音

# audio.recorded
source: Recording loaded.
zh_hans: 录音已载入。

# audio.recordFailed
source: Could not record audio.
zh_hans: 无法录制音频。

# audio.recording
source: Recording...
zh_hans: 正在录音...

# audio.recordPermissionDenied
source: Microphone permission was denied.
zh_hans: 麦克风权限已被拒绝。

# audio.sample
source: Sample Audio
zh_hans: 示例音频

# audio.stopRecording
source: Stop Recording
zh_hans: 停止录音

# choice.filterMode.bandPass
source: Band-pass
zh_hans: 带通

# choice.filterMode.highPass
source: High-pass
zh_hans: 高通

# choice.filterMode.lowPass
source: Low-pass
zh_hans: 低通

# choice.filterMode.notch
source: Notch
zh_hans: 陷波

# choice.filterMode.randomFrequencyResponse
source: Random Frequency Response
zh_hans: 随机频响

# choice.slope.12
source: 12 dB/oct
zh_hans: 12 dB/倍频程

# choice.slope.24
source: 24 dB/oct
zh_hans: 24 dB/倍频程

# choice.spectralMode.keepTopKFrequencyBins
source: Keep Top-K Frequency Bins
zh_hans: 保留 Top-K 频率

# choice.windowSize.128
source: 128 samples
zh_hans: 128 采样

# choice.windowSize.256
source: 256 samples
zh_hans: 256 采样

# choice.windowSize.512
source: 512 samples
zh_hans: 512 采样

# choice.windowSize.1024
source: 1,024 samples
zh_hans: 1,024 采样

# codec.reason.noRoundTripSupport
source: No real encode/decode round-trip is available.
zh_hans: 当前没有可用的真实编码 / 解码往返。

# codec.reason.planned
source: Planned for a future codec layer.
zh_hans: 计划在后续 codec 层支持。

# codec.reason.unavailableOnDevice
source: No system encoder round-trip is available on this device.
zh_hans: 此设备没有可用的系统编码器往返能力。

# codec.status.available
source: Available
zh_hans: 可用

# codec.status.planned
source: Planned
zh_hans: 计划中

# codec.status.unavailable
source: Unavailable
zh_hans: 暂不可用

# control.unavailable
source: Unavailable
zh_hans: 暂不可用

# editor.singleModule.placeholder
source: Module selection and parameters will appear here.
zh_hans: 模块选择和参数稍后会显示在这里。

# editor.singleModule.title
source: Single Module Editor
zh_hans: 单模块编辑器

# editor.workflow.placeholder
source: Workflow blocks and ordering controls will appear here.
zh_hans: 工作流模块和排序控件稍后会显示在这里。

# editor.workflow.title
source: Workflow Editor
zh_hans: 工作流编辑器

# effect.bitDepthReduction
source: Bit Depth Reduction
zh_hans: 位深降低

# effect.bitrateReduction
source: Bitrate Reduction
zh_hans: 码率降低

# effect.clipping
source: Clipping
zh_hans: 削波

# effect.compressor
source: Compressor
zh_hans: 压缩器

# effect.filterEQ
source: Filter / EQ
zh_hans: 滤波 / 均衡

# effect.limiter
source: Limiter
zh_hans: 限制器

# effect.lowQualityCodec
source: Low Quality Codec
zh_hans: 低质量编码器

# effect.sampleRateReduction
source: Sample Rate Reduction
zh_hans: 采样率降低

# effect.spectralDamage
source: Spectral Damage
zh_hans: 频谱破坏

# home.title
source: Deep-Fried Audio Player
zh_hans: 全损音质播放器

# mode.singleModule
source: Single Module
zh_hans: 单模块

# mode.title
source: Mode
zh_hans: 模式

# mode.workflow
source: Workflow
zh_hans: 工作流

# parameter.bits
source: Bit Depth
zh_hans: 位深

# parameter.bitRateKbps
source: Bitrate
zh_hans: 码率

# parameter.ceiling
source: Output Ceiling
zh_hans: 输出上限

# parameter.attack
source: Attack
zh_hans: 启动时间

# parameter.bandCount
source: Band Count
zh_hans: 频段数量

# parameter.centerFrequency
source: Center Frequency
zh_hans: 中心频率

# parameter.codec
source: Codec
zh_hans: 编码器

# parameter.componentCount
source: Component Count
zh_hans: 保留成分数

# parameter.cutoff
source: Cutoff
zh_hans: 截止频率

# parameter.depth
source: Depth
zh_hans: 深度

# parameter.drive
source: Drive
zh_hans: 驱动

# parameter.frequencyRange
source: Frequency Range
zh_hans: 频率范围

# parameter.gainRange
source: Gain Range
zh_hans: 增益范围

# parameter.highCut
source: High Cut
zh_hans: 高频截止

# parameter.inputGain
source: Input Gain
zh_hans: 输入增益

# parameter.intensity
source: Intensity
zh_hans: 强度

# parameter.lowCut
source: Low Cut
zh_hans: 低频截止

# parameter.makeupGain
source: Makeup Gain
zh_hans: 补偿增益

# parameter.maxFrequency
source: Max Frequency
zh_hans: 最高频率

# parameter.minFrequency
source: Min Frequency
zh_hans: 最低频率

# parameter.mix
source: Mix
zh_hans: 混合

# parameter.mode
source: Mode
zh_hans: 模式

# parameter.overlap
source: Overlap
zh_hans: 重叠

# parameter.preservePhase
source: Preserve Phase
zh_hans: 保留相位

# parameter.rangeLower
source: Lower
zh_hans: 下限

# parameter.rangeUpper
source: Upper
zh_hans: 上限

# parameter.ratio
source: Ratio
zh_hans: 压缩比

# parameter.release
source: Release
zh_hans: 释放时间

# parameter.resonance
source: Resonance / Q
zh_hans: 共振 / Q

# parameter.seed
source: Seed
zh_hans: 随机种子

# parameter.slope
source: Slope
zh_hans: 斜率

# parameter.targetSampleRate
source: Target Sample Rate
zh_hans: 目标采样率

# parameter.threshold
source: Threshold
zh_hans: 阈值

# parameter.width
source: Width
zh_hans: 宽度

# parameter.windowSize
source: Window Size
zh_hans: 窗口大小

# playback.original
source: Original
zh_hans: 原始音频

# playback.processed
source: Processed
zh_hans: 处理后音频

# playback.stop
source: Stop
zh_hans: 停止

# playback.failed
source: Could not play audio.
zh_hans: 无法播放音频。

# playback.noOriginal
source: Import, record, or generate audio before playing original audio.
zh_hans: 请先导入、录制或生成音频，再播放原始音频。

# playback.noProcessed
source: Render a processed preview before playing processed audio.
zh_hans: 请先渲染处理后预览，再播放处理后音频。

# playback.playingOriginal
source: Playing original audio.
zh_hans: 正在播放原始音频。

# playback.playingProcessed
source: Playing processed audio.
zh_hans: 正在播放处理后音频。

# playback.unavailableWhileRecording
source: Stop recording before playback.
zh_hans: 请先停止录音，再播放音频。

# processing.dirty
source: Preview needs rendering.
zh_hans: 预览需要重新渲染。

# processing.empty
source: No audio loaded.
zh_hans: 尚未载入音频。

source: Processing failed.
zh_hans: 处理失败。

# processing.processing
source: Processing...
zh_hans: 正在处理...

# processing.ready
source: Processed preview is ready.
zh_hans: 处理后预览已就绪。

# section.audioSource
source: Audio Source
zh_hans: 音频来源

# section.editor
source: Editor
zh_hans: 编辑器

# section.playback
source: Playback
zh_hans: 播放

# section.processing
source: Processing
zh_hans: 处理状态

# section.waveform
source: Waveform
zh_hans: 波形

# singleModule.loadPreset
source: Load Preset
zh_hans: 载入预设

# singleModule.modulePicker
source: Module
zh_hans: 模块

# singleModule.noParameters
source: This module has no editable parameters yet.
zh_hans: 这个模块暂时没有可编辑参数。

# singleModule.noPresetSelected
source: No Preset Selected
zh_hans: 未选择预设

# singleModule.parameters
source: Parameters
zh_hans: 参数

# singleModule.presetLoaded
source: Module preset loaded.
zh_hans: 模块预设已载入。

# singleModule.presetLoadFailed
source: Could not load module preset.
zh_hans: 无法载入模块预设。

# singleModule.presetName
source: Preset Name
zh_hans: 预设名称

# singleModule.presetNameRequired
source: Enter a preset name before saving.
zh_hans: 保存前请输入预设名称。

# singleModule.presets
source: Module Presets
zh_hans: 模块预设

# singleModule.presetSaved
source: Module preset saved.
zh_hans: 模块预设已保存。

# singleModule.presetSaveFailed
source: Could not save module preset.
zh_hans: 无法保存模块预设。

# singleModule.rangeLower
source: Lower
zh_hans: 下限

# singleModule.rangeUpper
source: Upper
zh_hans: 上限

# singleModule.renderFailed
source: Could not render module preview.
zh_hans: 无法渲染模块预览。

# singleModule.savedPresets
source: Saved Presets
zh_hans: 已保存预设

# singleModule.savePreset
source: Save Preset
zh_hans: 保存预设

# singleModule.sendToWorkflow
source: Send to Workflow
zh_hans: 发送到工作流

# singleModule.sentToWorkflow
source: Module sent to workflow.
zh_hans: 模块已发送到工作流。

# unit.dbPerOctave
source: dB/oct
zh_hans: dB/倍频程

# unit.linear
source: linear
zh_hans: 线性

# unit.octave
source: oct
zh_hans: 倍频程

# unit.samples
source: samples
zh_hans: 采样

# waveform.empty
source: Load or generate audio to see the waveform.
zh_hans: 载入或生成音频后会显示波形。

# waveform.original
source: Original waveform
zh_hans: 原始波形

# waveform.processed
source: Processed waveform
zh_hans: 处理后波形

# waveform.processedStale
source: Processed preview needs rendering.
zh_hans: 处理后预览需要重新渲染。

# workflow.addModule
source: Add Module
zh_hans: 添加模块

# workflow.blockEnabled
source: Enabled
zh_hans: 启用

# workflow.blockDisabled
source: Disabled
zh_hans: 已停用

source: Workflow Blocks
zh_hans: 工作流模块

# workflow.delete
source: Delete
zh_hans: 删除

# workflow.duplicate
source: Duplicate
zh_hans: 复制

# workflow.empty
source: No modules in this workflow yet.
zh_hans: 这个工作流还没有模块。

# workflow.loadPreset
source: Load Preset
zh_hans: 载入预设

# workflow.modulePicker
source: Module
zh_hans: 模块

# workflow.moduleDetails
source: Module Details
zh_hans: 模块详情

# workflow.moduleReceived
source: Module added to workflow.
zh_hans: 模块已加入工作流。

# workflow.moveDown
source: Move Down
zh_hans: 下移

# workflow.moveUp
source: Move Up
zh_hans: 上移

# workflow.noParameters
source: This module has no editable parameters yet.
zh_hans: 这个模块暂时没有可编辑参数。

# workflow.noPresetSelected
source: No Preset Selected
zh_hans: 未选择预设

source: Workflow preset loaded.
zh_hans: 工作流预设已载入。

# workflow.presetLoadFailed
source: Could not load workflow preset.
zh_hans: 无法载入工作流预设。

# workflow.presetName
source: Preset Name
zh_hans: 预设名称

# workflow.presetNameRequired
source: Enter a preset name before saving.
zh_hans: 保存前请输入预设名称。

source: Workflow Presets
zh_hans: 工作流预设

source: Workflow preset saved.
zh_hans: 工作流预设已保存。

# workflow.presetSaveFailed
source: Could not save workflow preset.
zh_hans: 无法保存工作流预设。

# workflow.renderFailed
source: Could not render workflow preview.
zh_hans: 无法渲染工作流预览。

# workflow.selectModulePrompt
source: Select a module to edit parameters.
zh_hans: 选择一个模块来编辑参数。

# workflow.savedPresets
source: Saved Presets
zh_hans: 已保存预设

# workflow.savePreset
source: Save Preset
zh_hans: 保存预设
